Repository: SantoshSrinivas79/web-maker
Catalog: src/locales/*/messages.po
Languages: es, ja

source: 'Oops! Selected file is corrupted. Please select a file that was generated by clicking the "Export" button.
es: "Oops! El archivo seleccionado está dañado. Seleccione un archivo que se generó haciendo clic en el botón "Exportar".
ja: おっと！選択されたファイルが破損しています。"エクスポート"ボタンをクリックして生成されたファイルを選択してください。

source: Add Library
es: Añadir librería
ja: ライブラリを追加

source: Add a JS/CSS library
es: Añadir una librería JS/CSS
ja: JS/CSSライブラリを追加

source: Add library
es: Añadir librería
ja: ライブラリを追加

source: Assets
ja: アセット

source: Choose from popular libraries
es: Elija entre las librerías populares
ja: 人気のあるライブラリから選択

source: Clear console (CTRL + L)
es: Borrar consola (CTRL + L)
ja: コンソールをクリア（CTRL + L）

source: Clear console (works when console input is focused)
es: Borrar consola (funciona cuando la entrada de la consola está enfocada)
ja: コンソールをクリア（コンソール入力がフォーカスされているときに機能します）

source: Close saved creations pane
es: Cerrar el panel creaciones guardadas
ja: 保存された作成物のペインを閉じる

source: Close saved creations panel & modals
es: Cerrar el panel de creaciones guardadas y modales
ja: 保存された作成物のパネルとモーダルを閉じる

source: Console
es: Consola
ja: コンソール

source: Detach preview
es: Separar la vista previa
ja: プレビューを分離する

source: Discuss
ja: ディスカッション

source: Double click to toggle console
es: Haga doble clic para alternar la consola
ja: ダブルクリックでコンソールを切り替える

source: Download game as zip
es: Descargar juego como zip
ja: ゲームをzipとしてダウンロード

source: Edit on CodePen
es: Editar en CodePen
ja: CodePenで編集

source: Editor
ja: エディター

source: Emmet code completion
es: Finalización del código Emmet
ja: Emmetコード補完

source: Export
es: Exportar
ja: エクスポート

source: Export all your creations into a single importable file.
es: Exporta todas tus creaciones en un único archivo importable.
ja: すべての作成物を1つのインポート可能なファイルにエクスポートします。

source: Find
es: Buscar
ja: 検索

source: Find & replace
es: Buscar y reemplazar
ja: 検索と置換

source: Fork
ja: フォーク

source: Fork this creation
ja: この作品をフォーク

source: Global
ja: グローバル

source: Help
es: Ayuda
ja: ヘルプ

source: Import
es: Importar
ja: インポート

source: Import your creations. Only the file that you export through the 'Export' button can be imported.
es: Importa tus creaciones. Sólo se puede importar el archivo que se exporta a través del botón "Exportar".
ja: 作成物をインポートします。'エクスポート'ボタンを通じてエクスポートされたファイルのみがインポート可能です。

source: Indent code left
es: Indentar código a la izquierda
ja: コードを左にインデント

source: Indent code right
es: Indentar código a la derecha
ja: コードを右にインデント

source: Keyboard Shortcuts
es: Atajos de Teclado
ja: キーボードショートカット

source: Keyboard shortcuts
es: Atajos de teclado
ja: キーボードショートカット

source: License
es: Licencia
ja: ライセンス

source: Login/Signup
es: Iniciar sesión/Registrarse
ja: ログイン/サインアップ

source: Mail me
ja: メールを送る

source: Manage
ja: 管理

source: Manage your PRO subscription
ja: PROサブスクリプションを管理

source: My Library
ja: マイライブラリ

source: New
es: Nuevo
ja: 新規

source: No match found.
es: No se encontró ninguna coincidencia.
ja: 一致するものが見つかりませんでした。

source: Note: You can load external scripts only from following domains:
es: Nota: Puedes cargar scripts externos sólo de los siguientes dominios:
ja: 注意: 次のドメインからのみ外部スクリプトを読み込むことができます：

source: Nothing saved here.
es: Aquí no hay nada guardado.
ja: ここには何も保存されていません。

source: Open
es: Abrir
ja: 開く

source: Open a saved creation (Ctrl/⌘ + O)
es: Abrir una creación guardada (Ctrl/⌘ + O)
ja: 保存された作成物を開く (Ctrl/⌘ + O)

source: Open list of saved creations
es: Abrir lista de creaciones guardadas
ja: 保存された作成物のリストを開く

source: Powered by cdnjs
es: Impulsado por cdnjs
ja: cdnjsによって提供

source: Put each library in new line
es: Poner cada biblioteca en una nueva línea
ja: 各ライブラリを新しい行に置く

source: Read more
es: Leer más
ja: もっと読む

source: Read the documentation.
es: Leer la documentación.
ja: ドキュメントを読む。

source: Realign code
es: Reajustar el código
ja: コードを再整列する

source: Refresh preview
es: Actualizar la vista previa
ja: プレビューを更新する

source: Report a bug
es: Reporta un error
ja: バグを報告する

source: Review Web Maker
es: Reseña de Web Maker
ja: Web Makerをレビューする

source: Run
es: Ejecutar
ja: 実行

source: Run Prettier
es: Ejecutar Prettier
ja: Prettierを実行

source: Run preview (Ctrl/⌘ + Shift + 5)
es: Ejecutar vista previa (Ctrl/⌘ + Shift + 5)
ja: プレビューを実行する (Ctrl/⌘ + Shift + 5)

source: Save
es: Guardar
ja: 保存

source: Save as HTML file
es: Guardar como archivo HTML
ja: HTMLファイルとして保存

source: Save current creation (Ctrl/⌘ + S)
es: Guardar la creación actual (Ctrl/⌘ + S)
ja: 現在の作成物を保存 (Ctrl/⌘ + S)

source: Save current creations
es: Guardar las creaciones actuales
ja: 現在の作成物を保存

source: Search your creations here...
es: Busca tus creaciones aquí...
ja: ここであなたの作成物を検索...

source: See awesome libraries used
es: Vea las increíbles librerías utilizadas
ja: 使用されている素晴らしいライブラリを見る

source: See changelog
es: Ver registro de cambios
ja: 変更ログを見る

source: See profile or Logout
es: Ver perfil o cerrar sesión
ja: プロフィールを見るまたはログアウト

source: Select next match
es: Seleccione el siguiente partido
ja: 次の一致を選択

source: Select previous match
es: Seleccione el partido anterior
ja: 前の一致を選択

source: Settings
es: Ajustes
ja: 設定

source: Share
ja: 共有

source: Share Web Maker
ja: Web Makerを共有

source: Share this creation publicly
ja: この作品を公開して共有

source: Single line comment
es: Comentario de una sola línea
ja: 単一行コメント

source: Start a new creation
es: Iniciar una nueva creación
ja: 新しい作成を開始

source: Switch to layout with all vertical panes
es: Cambiar a la disposición con todos los paneles verticales
ja: 全ての垂直ペインを持つレイアウトに切り替え

source: Switch to layout with preview on bottom
es: Cambiar al diseño con vista previa en la parte inferior
ja: 下部にプレビューがあるレイアウトに切り替え

source: Switch to layout with preview on left
es: Cambiar al diseño con vista previa a la izquierda
ja: 左側にプレビューがあるレイアウトに切り替え

source: Switch to layout with preview on right
es: Cambiar al diseño con vista previa a la derecha
ja: 右側にプレビューがあるレイアウトに切り替え

source: Take screenshot of preview
es: Tomar captura de pantalla de la vista previa
ja: プレビューのスクリーンショットを撮る

source: Toggle console
es: Alternar consola
ja: コンソールを切り替える

source: Toggle full screen preview
ja: フルスクリーンプレビューを切り替え

source: Tweet about 'Web Maker'
es: Tuitea sobre 'Web Maker'
ja: 'Web Maker'についてツイートする

source: Type here to search libraries
es: Escriba aquí para buscar en las librerías
ja: ライブラリを検索するためにここに入力してください

source: Upgrade to PRO and get some advanced superpowers!
ja: PROにアップグレードして高度な機能を手に入れましょう！

source: Upload Image
es: Cargar imagen
ja: 画像をアップロード

source: Upload/Use assets
ja: アセットをアップロード/使用
